{
 "Alavi 2013": "Alavi, A., Sharifi, B., Ghanizadeh, A., & Dehbozorgi, G. (2013). Effectiveness of cognitive-behavioral therapy in decreasing suicidal ideation and hopelessness of the adolescents with previous suicidal attempts. Iranian journal of pediatrics, 23(4), 467–472.",
"Amianto 2011": "Amianto, F., Ferrero, A., Pierò, A., Cairo, E., Rocca, G., Simonelli, B., Fassina, S., Abbate-Daga, G., & Fassino, S. (2011). Supervised team management, with or without structured psychotherapy, in heavy users of a mental health service with borderline personality disorder: a two-year follow- up preliminary randomized study. BMC psychiatry, 11, 181. https://doi.org/10.1186/1471-244X-11-181",
"Andreoli 2016": "Andreoli, A., Burnand, Y., Cochennec, M. F., Ohlendorf, P., Frambati, L., Gaudry-Maire, D., Di Clemente, T., Hourton, G., Lorillard, S., Canuto, A., & Frances, A. (2016). Disappointed Love and Suicide: A Randomized Controlled Trial of \"Abandonment Psychotherapy\" Among Borderline Patients. Journal of personality disorders, 30(2), 271–287. https://doi.org/10.1521/pedi_2015_29_196",
"Ardashir 2018": "Afrasiabifar, Ardashir & Hosseini, Nazafarin & Haghgoo, Amin. (2018). The Effects of Group Cognitive Behavior Therapy (GCBT) on Suicidal Thoughts in Patients with Major Depression. World Family Medicine Journal/Middle East Journal of Family Medicine. 16. 228-235. 10.5742/MEWFM.2018.93293.",
"Arnevik 2009": "Arnevik, E., Wilberg, T., Urnes, O., Johansen, M., Monsen, J. T., & Karterud,S. (2009). Psychotherapy for personality disorders: short-term day hospital psychotherapy versus outpatient individual therapy - a randomized controlled study. European psychiatry : the journal of the Association of European Psychiatrists, 24(2), 71–78. https://doi.org/10.1016/j.eurpsy.2008.09.004",
"Asarnow 2011": "Asarnow, J. R., Baraff, L. J., Berk, M., Grob, C. S., Devich-Navarro, M., Suddath, R., Piacentini, J. C., Rotheram-Borus, M. J., Cohen, D., & Tang, L. (2011). An emergency department intervention for linking pediatric suicidal patients to follow-up mental health treatment. Psychiatric services (Washington, D.C.), 62(11), 1303–1309. https://doi.org/10.1176/ps.62.11.pss6211_1303",
"Asarnow 2017": "Asarnow, J. R., Hughes, J. L., Babeva, K. N., & Sugar, C. A. (2017). Cognitive-Behavioral Family Treatment for Suicide Attempt Prevention: A Randomized Controlled Trial. Journal of the American Academy of Child and Adolescent Psychiatry, 56(6), 506–514. https://doi.org/10.1016/j.jaac.2017.03.015",
"Asarnow 2019": "Asarnow, J. R., Tompson, M. C., Klomhaus, A. M., Babeva, K., Langer, D. A., & Sugar, C. A. (2020). Randomized controlled trial of family‐focused treatment for child depression compared to individual psychotherapy: one‐year outcomes. Journal of child psychology and psychiatry, 61(6), 662-671.",
"Ayar 2020": "Ayar, D., & Sabanciogullari, S. (2021). The effect of a solution‐oriented approach in depressive patients on social functioning levels and suicide probability. Perspectives in psychiatric care, 57(1), 235-245.",
"Bannan 2010": "Bannan, Noreen, (2010), Group-based problem-solving therapy in self- poisoning females: A pilot study. Counselling and Psychotherapy Research, 10 doi: 10.1080/14733140903337292.",
"Barnes 2021": "Barnes, S. M., Borges, L. M., Smith, G. P., Walser, R. D., Forster, J. E., & Bahraini, N. H. (2021). Acceptance and commitment therapy to promote recovery from suicidal crises: A randomized controlled acceptability and feasibility trial of ACT for life. Journal of Contextual Behavioral Science, 20, 35-45.",
"Barnhofer 2009": "Barnhofer, T., Crane, C., Hargus, E., Amarasinghe, M., Winder, R., & Williams, J. M. (2009). Mindfulness-based cognitive therapy as a treatment for chronic depression: A preliminary study. Behaviour research and therapy, 47(5), 366–373. https://doi.org/10.1016/j.brat.2009.01.019",
"Bateman 1999": "Bateman, A., & Fonagy, P. (1999). Effectiveness of partial hospitalization in the treatment of borderline personality disorder: a randomized controlled trial. The American journal of psychiatry, 156(10), 1563–1569. https://doi.org/10.1176/ajp.156.10.1563",
"Bateman 2009": "Bateman, A., & Fonagy, P. (2009). Randomized controlled trial of outpatient mentalization-based treatment versus structured clinical management for borderline personality disorder. The American journal of psychiatry, 166(12), 1355–1364. https://doi.org/10.1176/appi.ajp.2009.09040539",
"Bentley 2017": "Bentley, K. H., Sauer-Zavala, S., Cassiello-Robbins, C. F., Conklin, L. R., Vento, S., & Homer, D. (2017). Treating Suicidal Thoughts and Behaviors Within an Emotional Disorders Framework: Acceptability and Feasibility of the Unified Protocol in an Inpatient Setting. Behavior modification, 41(4), 529–557. https://doi.org/10.1177/0145445516689661",
"Blomdahl 2018": "Blomdahl, C., Guregård, S., Rusner, M., & Wijk, H. (2018). A manual-based phenomenological art therapy for individuals diagnosed with moderate to severe depression (PATd): A randomized controlled study. Psychiatric rehabilitation journal, 41(3), 169–182. https://doi.org/10.1037/prj0000300",
"Brenner 2018": "Brenner, L. A., Forster, J. E., Hoffberg, A. S., Matarazzo, B. B., Hostetter, T. A., Signoracci, G., & Simpson, G. K. (2018). Window to Hope: A Randomized Controlled Trial of a Psychological Intervention for the Treatment of Hopelessness Among Veterans With Moderate to Severe Traumatic Brain Injury. The Journal of head trauma rehabilitation, 33(2), E64–E73. https://doi.org/10.1097/HTR.0000000000000351",
"Brent 1997": "Brent, D. A., Holder, D., Kolko, D., Birmaher, B., Baugher, M., Roth, C., Iyengar, S., & Johnson, B. A. (1997). A clinical psychotherapy trial for adolescent depression comparing cognitive, family, and supportive therapy. Archives of general psychiatry, 54(9), 877–885. https://doi.org/10.1001/archpsyc.1997.01830210125017",
"Britton 2020": "Britton, P. C., Conner, K. R., Chapman, B. P., & Maisto, S. A. (2020). Motivational interviewing to address suicidal ideation: A randomized controlled trial in veterans. Suicide and Life‐Threatening Behavior, 50(1), 233-248.",
"Brown 2005": "Brown, G. K., Ten Have, T., Henriques, G. R., Xie, S. X., Hollander, J. E., & Beck, A. T. (2005). Cognitive therapy for the prevention of suicide attempts: a randomized controlled trial. JAMA, 294(5), 563–570. https://doi.org/10.1001/jama.294.5.563",
"Brown 2019": "Brown, L. A., McLean, C. P., Zang, Y., Zandberg, L., Mintz, J., Yarvis, J. S., Litz, B. T., Peterson, A. L., Bryan, C. J., Fina, B., Petersen, J., Dondanville, K. A., Roache, J. D., Young-McCaughan, S., Foa, E. B., & STRONG STAR consortium (2019). Does prolonged exposure increase suicide risk? Results from an active duty military sample. Behaviour research and therapy, 118, 87–93. https://doi.org/10.1016/j.brat.2019.04.003",
"Bryan 2017": "Bryan, C. J., Mintz, J., Clemans, T. A., Leeson, B., Burch, T. S., Williams, S. R., Maney, E., & Rudd, M. D. (2017). Effect of crisis response planning vs. contracts for safety on suicide risk in U.S. Army Soldiers: A randomized clinical trial. Journal of affective disorders, 212, 64–72. https://doi.org/10.1016/j.jad.2017.01.028",
"Celano 2017": "Celano, C. M., Beale, E. E., Mastromauro, C. A., Stewart, J. G., Millstein, R. A., Auerbach, R. P., Bedoya, C. A., & Huffman, J. C. (2017). Psychological interventions to reduce suicidality in high-risk patients with major depression: a randomized controlled trial. Psychological medicine, 47(5), 810–821. https://doi.org/10.1017/S0033291716002798",
"Chanen 2022": "Chanen, A. M., Jackson, H. J., McCutcheon, L. K., Jovev, M., Dudgeon, P., Yuen, H. P., Germano, D., Nistico, H., McDougall, E., Weinstein, C., Clarkson, V., & McGorry, P. D. (2008). Early intervention for adolescents with borderline personality disorder using cognitive analytic therapy: randomised controlled trial. The British journal of psychiatry : the journal of mental science, 193(6), 477–484. https://doi.org/10.1192/bjp.bp.107.048934",
"Comtois 2011": "Comtois, K. A., Jobes, D. A., S O'Connor, S., Atkins, D. C., Janis, K., E Chessen, C., Landes, S. J., Holen, A., & Yuodelis-Flores, C. (2011). Collaborative assessment and management of suicidality (CAMS): feasibility trial for next-day appointment services. Depression and anxiety, 28(11), 963– 972. https://doi.org/10.1002/da.20895",
"Conner 2021": "Conner, K. R., Kearns, J. C., Esposito, E. C., Pizzarello, E., Wiegand, T. J., Britton, P. C., ... & Goldston, D. B. (2021). Pilot RCT of the Attempted Suicide Short Intervention Program (ASSIP) adapted for rapid delivery during hospitalization to adult suicide attempt patients with substance use problems. General hospital psychiatry, 72, 66-72.",
"Cottraux 2009": "Cottraux, J., Note, I. D., Boutitie, F., Milliery, M., Genouihlac, V., Yao, S. N., Note, B., Mollard, E., Bonasse, F., Gaillard, S., Djamoussian, D., Guillard, C., Culem, A., & Gueyffier, F. (2009). Cognitive therapy versus Rogerian supportive therapy in borderline personality disorder. Two-year follow-up of a controlled pilot study. Psychotherapy and psychosomatics, 78(5), 307–316. https://doi.org/10.1159/000229769",
"Cottrell 2018": "Cottrell, D. J., Wright-Hughes, A., Collinson, M., Boston, P., Eisler, I., Fortune, S., Graham, E. H., Green, J., House, A. O., Kerfoot, M., Owens, D. W., Saloniki, E. C., Simic, M., Lambert, F., Rothwell, J., Tubeuf, S., & Farrin,J. (2018). Effectiveness of systemic family therapy versus treatment as usual for young people after self-harm: a pragmatic, phase 3, multicentre, randomised controlled trial. The lancet. Psychiatry, 5(3), 203–216. https://doi.org/10.1016/S2215-0366(18)30058-0",
"Crawford 2020": "Crawford, M. J., Thana, L., Parker, J., Turner, O., Xing, K. P., McMurran, M., Moran, P., Weaver, T., Barrett, B., Claringbold, A., Bassett, P., & Sanatinia,R. (2018). Psychological Support for Personality (PSP) versus treatment as usual: study protocol for a feasibility randomized controlled trial of a low intensity intervention for people with personality disorder. Trials, 19(1), 547. https://doi.org/10.1186/s13063-018-2920-0",
"Daneshvar 2020": "Daneshvar, S., Shafiei, M., & Basharpoor, S. (2022). Compassion-focused therapy: Proof of concept trial on suicidal ideation and cognitive distortions in female survivors of intimate partner violence with PTSD. Journal of interpersonal violence, 37(11-12), NP9613-NP9634.",
"Davidson 2006": "Davidson, K., Norrie, J., Tyrer, P., Gumley, A., Tata, P., Murray, H., & Palmer, S. (2006). The effectiveness of cognitive behavior therapy for borderline personality disorder: results from the borderline personality disorder study of cognitive therapy (BOSCOT) trial. Journal of personality disorders, 20(5), 450–465. https://doi.org/10.1521/pedi.2006.20.5.450",
"Davidson 2014": "Davidson, K. M., Brown, T. M., James, V., Kirk, J., & Richardson, J. (2014). Manual-assisted cognitive therapy for self-harm in personality disorder and substance misuse: a feasibility trial. Psychiatric bulletin (2014), 38(3), 108– 111. https://doi.org/10.1192/pb.bp.113.043109",
"De Jonge-Heesen 2020": "de Jonge-Heesen, K. W., Rasing, S. P., Vermulst, A. A., Scholte, R. H., Van Ettekoven, K. M., Engels, R. C., & Creemers, D. H. (2021). Secondary outcomes of implemented depression prevention in adolescents: a randomized controlled trial. Frontiers in Psychiatry, 12, 643632.",
"DeGroot 2007": "de Groot, M., de Keijser, J., Neeleman, J., Kerkhof, A., Nolen, W., & Burger,H. (2007). Cognitive behaviour therapy to prevent complicated grief among relatives and spouses bereaved by suicide: cluster randomised controlled trial. BMJ (Clinical research ed.), 334(7601), 994. https://doi.org/10.1136/bmj.39161.457431.55",
"Diamond 2010": "Diamond, G. S., Wintersteen, M. B., Brown, G. K., Diamond, G. M., Gallop, R., Shelef, K., & Levy, S. (2010). Attachment-based family therapy for adolescents with suicidal ideation: a randomized controlled trial. Journal of the American Academy of Child and Adolescent Psychiatry, 49(2), 122–131. https://doi.org/10.1097/00004583-201002000-00006",
"Diamond 2019": "Diamond, G. S., Kobak, R. R., Krauthamer Ewing, E. S., Levy, S. A., Herres,J. L., Russon, J. M., & Gallop, R. J. (2019). A Randomized Controlled Trial: Attachment-Based Family and Nondirective Supportive Treatments for Youth Who Are Suicidal. Journal of the American Academy of Child and Adolescent Psychiatry, 58(7), 721–731. https://doi.org/10.1016/j.jaac.2018.10.006",
"Doering 2010": "Doering, S., Hörz, S., Rentrop, M., Fischer-Kern, M., Schuster, P., Benecke, C., Buchheim, A., Martius, P., & Buchheim, P. (2010). Transference-focused psychotherapy v. treatment by community psychotherapists for borderline personality disorder: randomised controlled trial. The British journal of psychiatry : the journal of mental science, 196(5), 389–395. https://doi.org/10.1192/bjp.bp.109.070177",
"Donaldson 2005": "Donaldson, D., Spirito, A., & Esposito-Smythers, C. (2005). Treatment for adolescents following a suicide attempt: results of a pilot trial. Journal of the American Academy of Child and Adolescent Psychiatry, 44(2), 113–120. https://doi.org/10.1097/00004583-200502000-00003",
"Ducasse 2018": "Ducasse, D., Jaussent, I., Arpon-Brand, V., Vienot, M., Laglaoui, C., Béziat, S., Calati, R., Carrière, I., Guillaume, S., Courtet, P., & Olié, E. (2018). Acceptance and Commitment Therapy for the Management of Suicidal Patients: A Randomized Controlled Trial. Psychotherapy and psychosomatics, 87(4), 211–222. https://doi.org/10.1159/000488715",
"Ducasse 2019": "Ducasse, D., Dassa, D., Courtet, P., Brand-Arpon, V., Walter, A., Guillaume, S., Jaussent, I., & Olié, E. (2019). Gratitude diary for the management of suicidal inpatients: A randomized controlled trial. Depression and anxiety, 36(5), 400–411. https://doi.org/10.1002/da.22877",
"Ertl 2011": "Ertl, V., Pfeiffer, A., Schauer, E., Elbert, T., & Neuner, F. (2011). Community-implemented trauma therapy for former child soldiers in Northern Uganda: a randomized controlled trial. JAMA, 306(5), 503–512. https://doi.org/10.1001/jama.2011.1060",
"Eskin 2008": "Eskin, M., Ertekin, K. & Demir, H. Efficacy of a Problem-Solving Therapy for Depression and Suicide Potential in Adolescents and Young Adults. Cogn Ther Res 32, 227–245 (2008). https://doi.org/10.1007/s10608-007-9172-8",
"Esposito-Smythers 2011": "Esposito-Smythers, C., Spirito, A., Kahler, C. W., Hunt, J., & Monti, P. (2011). Treatment of co-occurring substance abuse and suicidality among adolescents: a randomized trial. Journal of consulting and clinical psychology, 79(6), 728–739. https://doi.org/10.1037/a0026074",
"Esposito-Smythers 2019": "Esposito-Smythers, C., Wolff, J. C., Liu, R. T., Hunt, J. I., Adams, L., Kim, K., Frazier, E. A., Yen, S., Dickstein, D. P., & Spirito, A. (2019). Family-focused cognitive behavioral treatment for depressed adolescents in suicidal crisis with co-occurring risk factors: a randomized trial. Journal of child psychology and psychiatry, and allied disciplines, 60(10), 1133–1141. https://doi.org/10.1111/jcpp.13095",
"Evans 1999": "Evans, K., Tyrer, P., Catalan, J., Schmidt, U., Davidson, K., Dent, J., Tata, P., Thornton, S., Barber, J., & Thompson, S. (1999). Manual-assisted cognitive- behaviour therapy (MACT): a randomized controlled trial of a brief intervention with bibliotherapy in the treatment of recurrent deliberate self- harm. Psychological medicine, 29(1), 19–25. https://doi.org/10.1017/s003329179800765x",
"Eylem 2021": "Eylem, O., van Straten, A., Bhui, K., & Kerkhof, A. J. (2015). Protocol: Reducing suicidal ideation among Turkish migrants in the Netherlands and in the UK: effectiveness of an online intervention. International review of psychiatry (Abingdon, England), 27(1), 72–81. https://doi.org/10.3109/09540261.2014.996121",
"Fereidouni 2019": "Fereidouni, Z., Behnammoghadam, M., Jahanfar, A., & Dehghan, A. (2019). The Effect of Eye Movement Desensitization and Reprocessing (EMDR) on the severity of suicidal thoughts in patients with major depressive disorder: a randomized controlled trial. Neuropsychiatric disease and treatment, 2459-2466.",
"Ghahramanlou-Holloway 2018": "Ghahramanlou-Holloway, M., Lee-Tauler, S. Y., LaCroix, J. M., Kauten, R., Perera, K., Chen, R., Weaver, J., & Soumoff, A. (2018). Dysfunctional personality disorder beliefs and lifetime suicide attempts among psychiatrically hospitalized military personnel. Comprehensive psychiatry, 82, 108–114. https://doi.org/10.1016/j.comppsych.2018.01.010",
"Goldstein 2015": "Goldstein, T. R., Fersch-Podrat, R. K., Rivera, M., Axelson, D. A., Merranko, J., Yu, H., Brent, D. A., & Birmaher, B. (2015). Dialectical behavior therapy for adolescents with bipolar disorder: results from a pilot randomized trial. Journal of child and adolescent psychopharmacology, 25(2), 140–149. https://doi.org/10.1089/cap.2013.0145",
"Goldston 2022": "Goldstein, T. R., Fersch-Podrat, R. K., Rivera, M., Axelson, D. A., Merranko, J., Yu, H., Brent, D. A., & Birmaher, B. (2015). Dialectical behavior therapy for adolescents with bipolar disorder: results from a pilot randomized trial. Journal of child and adolescent psychopharmacology, 25(2), 140–149. https://doi.org/10.1089/cap.2013.0145",
"Goodman 2016": "Goodman, M., Banthin, D., Blair, N. J., Mascitelli, K. A., Wilsnack, J., Chen, J., Messenger, J. W., Perez-Rodriguez, M. M., Triebwasser, J., Koenigsberg,H. W., Goetz, R. R., Hazlett, E. A., & New, A. S. (2016). A Randomized Trial of Dialectical Behavior Therapy in High-Risk Suicidal Veterans. The Journal of clinical psychiatry, 77(12), e1591–e1600. https://doi.org/10.4088/JCP.15m10235",
"Goodman 2022": "Goodman, M., Sullivan, S. R., Spears, A. P., Crasta, D., Mitchell, E. L., Stanley, B., ... & Glynn, S. (2022). A pilot randomized control trial of a dyadic safety planning intervention: Safe actions for families to encourage recovery. Couple and Family Psychology: Research and Practice, 11(1), 42.",
"Goodyer 2008": "Goodyer, I. M., Dubicka, B., Wilkinson, P., Kelvin, R., Roberts, C., Byford, S., Breen, S., Ford, C., Barrett, B., Leech, A., Rothwell, J., White, L., & Harrington, R. (2008). A randomised controlled trial of cognitive behaviour therapy in adolescents with major depression treated by selective serotonin reuptake inhibitors. The ADAPT trial. Health technology assessment (Winchester, England), 12(14), iii–60. https://doi.org/10.3310/hta12140",
"Green 2011": "Green, J. M., Wood, A. J., Kerfoot, M. J., Trainor, G., Roberts, C., Rothwell, J., Woodham, A., Ayodeji, E., Barrett, B., Byford, S., & Harrington, R. (2011). Group therapy for adolescents with repeated self harm: randomised controlled trial with economic evaluation. BMJ (Clinical research ed.), 342, d682. https://doi.org/10.1136/bmj.d682",
"Gregory 2008": "Gregory, R. J., Chlebowski, S., Kang, D., Remen, A. L., Soderberg, M. G., Stepkovitch, J., & Virk, S. (2008). A controlled trial of psychodynamic psychotherapy for co-occurring borderline personality disorder and alcohol use disorder. Psychotherapy (Chicago, Ill.), 45(1), 28–41. https://doi.org/10.1037/0033-3204.45.1.28",
"Grupp-Phelan 2019": "Grupp-Phelan, J., Stevens, J., Boyd, S., Cohen, D. M., Ammerman, R. T., Liddy-Hicks, S., ... & Bridge, J. A. (2019). Effect of a motivational interviewing–based intervention on initiation of mental health treatment and mental health after an emergency department visit among suicidal adolescents: a randomized clinical trial. JAMA network open, 2(12), e1917941-e1917941.",
"Guthrie 2001": "Guthrie, E., Kapur, N., Mackway-Jones, K., Chew-Graham, C., Moorey, J., Mendel, E., Marino-Francis, F., Sanderson, S., Turpin, C., Boddy, G., & Tomenson, B. (2001). Randomised controlled trial of brief psychological intervention after deliberate self poisoning. BMJ (Clinical research ed.), 323(7305), 135–138. https://doi.org/10.1136/bmj.323.7305.135",
"Gutierrez 2021": "Gutierrez, P. M., Johnson, L., Podlogar, M. C., Hagman, S., Muehler, T. A., Hanson, J., ... & O’Connor, S. (2022). Pilot study of the Collaborative Assessment and Management of Suicidality—Group. Suicide and Life‐Threatening Behavior, 52(2), 244-255.",
"Gysin-Maillart 2016": "Gysin-Maillart, A., Schwab, S., Soravia, L., Megert, M., & Michel, K. (2016). A Novel Brief Therapy for Patients Who Attempt Suicide: A 24-months Follow-Up Randomized Controlled Study of the Attempted Suicide Short Intervention Program (ASSIP). PLoS medicine, 13(3), e1001968. https://doi.org/10.1371/journal.pmed.1001968",
"Haddock 2019": "Haddock, G., Pratt, D., Gooding, P. A., Peters, S., Emsley, R., Evans, E., Kelly, J., Huggett, C., Munro, A., Harris, K., Davies, L., & Awenat, Y. (2019). Feasibility and acceptability of suicide prevention therapy on acute psychiatric wards: randomised controlled trial. BJPsych open, 5(1), e14. https://doi.org/10.1192/bjo.2018.85",
"Hahm 2019": "Hahm, H. C., Zhou, L., Lee, C., Maru, M., Petersen, J. M., & Kolaczyk, E. D. (2019). Feasibility, preliminary efficacy, and safety of a randomized clinical trial for Asian Women's Action for Resilience and Empowerment (AWARE) intervention. The American journal of orthopsychiatry, 89(4), 462–474. https://doi.org/10.1037/ort0000383",
"Harrington 1998": "Harrington, R., Kerfoot, M., Dyer, E., McNiven, F., Gill, J., Harrington, V., Woodham, A., & Byford, S. (1998). Randomized trial of a home-based family intervention for children who have deliberately poisoned themselves. Journal of the American Academy of Child and Adolescent Psychiatry, 37(5), 512– 518.",
"Hatcher 2011": "Hatcher, S., Sharon, C., Parag, V., & Collins, N. (2011). Problem-solving therapy for people who present to hospital with self-harm: Zelen randomised controlled trial. The British journal of psychiatry : the journal of mental science, 199(4), 310–316. https://doi.org/10.1192/bjp.bp.110.090126",
"Hatcher 2015": "Hatcher, S., Sharon, C., House, A., Collins, N., Collings, S., & Pillai, A. (2015). The ACCESS study: Zelen randomised controlled trial of a package of care for people presenting to hospital after self-harm. The British journal of psychiatry : the journal of mental science, 206(3), 229–236. https://doi.org/10.1192/bjp.bp.113.135780",
"Hatcher 2016": "Hatcher, S., Coupe, N., Wikiriwhi, K., Durie, S. M., & Pillai, A. (2016). Te Ira Tangata: a Zelen randomised controlled trial of a culturally informed treatment compared to treatment as usual in Māori who present to hospital after selfharm. Social psychiatry and psychiatric epidemiology, 51(6), 885–894. https://doi.org/10.1007/s00127-016-1194-7",
"Hazell 2009": "Hazell, P. L., Martin, G., Mcgill, K., Kay, T., Wood, A., Trainor, G., & Harrington, R. (2009). Group therapy for repeated deliberate self-harm in adolescents: failure of replication of a randomized trial. Journal of the American Academy of Child and Adolescent Psychiatry, 48(6), 662–670. https://doi.org/10.1097/CHI.0b013e3181aOacec",
"Hetrick 2017": "Hetrick, S. E., Yuen, H. P., Bailey, E., Cox, G. R., Templer, K., Rice, S. M., Bendall, S., & Robinson, J. (2017). Internet-based cognitive behavioural therapy for young people with suicide-related behaviour (Reframe-IT): a randomised controlled trial. Evidence-based mental health, 20(3), 76–82. https://doi.org/10.1136/eb-2017-102719",
"Hill 2019": "Hill, R. M., & Pettit, J. W. (2019). Pilot Randomized Controlled Trial of LEAP: A Selective Preventive Intervention to Reduce Adolescents' Perceived Burdensomeness. Journal of clinical child and adolescent psychology : the official journal for the Society of Clinical Child and Adolescent Psychology, American Psychological Association, Division 53, 48(sup1), S45–S56. https://doi.org/10.1080/15374416.2016.1188705",
"Hogberg 2018": "Högberg, G., & Hällström, T. (2018). Mood Regulation Focused CBT Based on Memory Reconsolidation, Reduced Suicidal Ideation and Depression in Youth in a Randomised Controlled Study. International journal of environmental research and public health, 15(5), 921. https://doi.org/10.3390/ijerph15050921",
"Huey 2004": "Huey, S. J., Jr, Henggeler, S. W., Rowland, M. D., Halliday-Boykins, C. A., Cunningham, P. B., Pickrel, S. G., & Edwards, J. (2004). Multisystemic therapy effects on attempted suicide by youths presenting psychiatric emergencies. Journal of the American Academy of Child and Adolescent Psychiatry, 43(2), 183–190. https://doi.org/10.1097/00004583-200402000- 00014",
"Husain 2014": "Husain, N., Afsar, S., Ara, J., Fayyaz, H., Rahman, R. U., Tomenson, B., Hamirani, M., Chaudhry, N., Fatima, B., Husain, M., Naeem, F., & Chaudhry,B. (2014). Brief psychological intervention after self-harm: randomised controlled trial from Pakistan. The British journal of psychiatry : the journal of mental science, 204(6), 462–470. https://doi.org/10.1192/bjp.bp.113.138370",
"Hvid 2011": "Hvid, M., Vangborg, K., Sørensen, H. J., Nielsen, I. K., Stenborg, J. M., & Wang, A. G. (2011). Preventing repetition of attempted suicide--II. The Amager project, a randomized controlled trial. Nordic journal of psychiatry, 65(5), 292–298. https://doi.org/10.3109/08039488.2010.544404",
"Interian 2021": "Interian, A., Chesin, M. S., Stanley, B., Latorre, M., Hill, L. M. S., Miller, R. B., ... & Kline, A. (2021). Mindfulness-based cognitive therapy for preventing suicide in military veterans: a randomized clinical trial. The Journal of Clinical Psychiatry, 82(5), 36479.",
"Jamshidi 2020": "Jamshidi, F., Rajabi, S., & Dehghani, Y. (2021). How to heal their psychological wounds? effectiveness of EMDR therapy on post‐traumatic stress symptoms, mind‐wandering and suicidal ideation in Iranian child abuse victims. Counselling and Psychotherapy Research, 21(2), 412-421.",
"Jobes 2017": "Jobes, D. A., Comtois, K. A., Gutierrez, P. M., Brenner, L. A., Huh, D., Chalker, S. A., Ruhe, G., Kerbrat, A. H., Atkins, D. C., Jennings, K., Crumlish, J., Corona, C. D., Connor, S. O., Hendricks, K. E., Schembari, B., Singer, B., & Crow, B. (2017). A Randomized Controlled Trial of the Collaborative Assessment and Management of Suicidality versus Enhanced Care as Usual With Suicidal Soldiers. Psychiatry, 80(4), 339–356. https://doi.org/10.1080/00332747.2017.1354607",
"Johnson (J) 2019": "Johnson, J. E., Stout, R. L., Miller, T. R., Zlotnick, C., Cerbo, L. A., Andrade,J. T., Nargiso, J., Bonner, J., & Wiltsey-Stirman, S. (2019). Randomized cost- effectiveness trial of group interpersonal psychotherapy (IPT) for prisoners with major depression. Journal of consulting and clinical psychology, 87(4), 392–406. https://doi.org/10.1037/ccp0000379",
"Kaslow 2010": "Kaslow, N. J., Leiner, A. S., Reviere, S., Jackson, E., Bethea, K., Bhaju, J., Rhodes, M., Gantt, M. J., Senter, H., & Thompson, M. P. (2010). Suicidal, abused African American women's response to a culturally informed intervention. Journal of consulting and clinical psychology, 78(4), 449–458. https://doi.org/10.1037/a0019692",
"King 2015": "King, C. A., Gipson, P. Y., Horwitz, A. G., & Opperman, K. J. (2015). Teen options for change: an intervention for young emergency patients who screen positive for suicide risk. Psychiatric services (Washington, D.C.), 66(1), 97– 100. https://doi.org/10.1176/appi.ps.201300347",
"Koons 2001": "Koons, Cedar & Robins, Clive & Tweed, J. & Lynch, Thomas & Gonzalez, Alicia & Morse, Jennifer & Bishop, G. & Butterfield, Marian. (2001). Efficacy of dialectical behavior therapy in women veterans with borderline Personality disorder. Behavior Therapy. 32. 371-390. 10.1016/S0005- 7894(01)80009-5.",
"LaCroix 2018": "LaCroix, J. M., Perera, K. U., Neely, L. L., Grammer, G., Weaver, J., & Ghahramanlou-Holloway, M. (2018). Pilot trial of post-admission cognitive therapy: Inpatient program for suicide prevention. Psychological services, 15(3), 279–288. https://doi.org/10.1037/ser0000224 100.Smits, M. L., Feenstra, D. J., Eeren, H. V., Bales, D. L., Laurenssen, E.,",
"Lin (C-J) 2020": "Lin, C. J., Huang, Y. H., Huang, K. Y., Wu, S. I., Chang, Y. H., Yeh, H. M., ... & Liu, S. I. (2020). A randomized controlled trial of transcultural validation of group-based psychosocial intervention for patients with bipolar disorder. Psychiatry Research, 290, 113139.",
"Lin (Y-C) 2020": "Lin, Y. C., Liu, S. I., Chen, S. C., Sun, F. J., Huang, H. C., Huang, C. R., & Chiu, Y. C. (2020). Brief cognitive‐based psychosocial intervention and case management for suicide attempters discharged from the emergency department in Taipei, taiwan: a randomized controlled study. Suicide and Life‐Threatening Behavior, 50(3), 688-705.",
"Linehan 2006": "Linehan, M. M., Comtois, K. A., Murray, A. M., Brown, M. Z., Gallop, R. J., Heard, H. L., Korslund, K. E., Tutek, D. A., Reynolds, S. K., & Lindenboim, N. (2006). Two-year randomized controlled trial and follow-up of dialectical behavior therapy vs therapy by experts for suicidal behaviors and borderline personality disorder. Archives of general psychiatry, 63(7), 757–766. https://doi.org/10.1001/archpsyc.63.7.757",
"LoParo 2018": "LoParo, D., Mack, S. A., Patterson, B., Negi, L. T., & Kaslow, N. J. (2018). The efficacy of cognitively-based compassion training for African American suicide attempters. Mindfulness, 9(6), 1941–1954. https://doi.org/10.1007/s12671-018-0940-1",
"Lu 2019": "Lu, R., Zhou, Y., Wu, Q., Peng, X., Dong, J., Zhu, Z., & Xu, W. (2019). The effects of mindfulness training on suicide ideation among left-behind children in China: A randomized controlled trial. Child: care, health and development, 45(3), 371–379. https://doi.org/10.1111/cch.12650",
"Lynch 2020": "Lynch, T. R., Hempel, R. J., Whalley, B., Byford, S., Chamba, R., Clarke, P., ... & Russell, I. T. (2020). Refractory depression–mechanisms and efficacy of radically open dialectical behaviour therapy (RefraMED): findings of a randomised trial on benefits and harms. The British Journal of Psychiatry, 216(4), 204-212.",
"Marasinghe 2012": "Marasinghe, R. B., Edirippulige, S., Kavanagh, D., Smith, A., & Jiffry, M. T. (2012). Effect of mobile phone-based psychotherapy in suicide prevention: a randomized controlled trial in Sri Lanka. Journal of telemedicine and telecare, 18(3), 151–155. https://doi.org/10.1258/jtt.2012.SFT107",
"Marasinghe 2012": "Marasinghe, R. B., Edirippulige, S., Kavanagh, D., Smith, A., & Jiffry, M. T. (2012). Effect of mobile phone-based psychotherapy in suicide prevention: a randomized controlled trial in Sri Lanka. Journal of telemedicine and telecare, 18(3), 151–155. https://doi.org/10.1258/jtt.2012.SFT107",
"March 2004": "March, J., Silva, S., Petrycki, S., Curry, J., Wells, K., Fairbank, J., Burns, B., Domino, M., McNulty, S., Vitiello, B., Severe, J., & Treatment for Adolescents With Depression Study (TADS) Team (2004). Fluoxetine, cognitive-behavioral therapy, and their combination for adolescents with depression: Treatment for Adolescents With Depression Study (TADS) randomized controlled trial. JAMA, 292(7), 807–820. https://doi.org/10.1001/jama.292.7.807",
"March 2004": "March, J., Silva, S., Petrycki, S., Curry, J., Wells, K., Fairbank, J., Burns, B., Domino, M., McNulty, S., Vitiello, B., Severe, J., & Treatment for Adolescents With Depression Study (TADS) Team (2004). Fluoxetine, cognitive-behavioral therapy, and their combination for adolescents with depression: Treatment for Adolescents With Depression Study (TADS) randomized controlled trial. JAMA, 292(7), 807–820. https://doi.org/10.1001/jama.292.7.807",
"McAuliffe 2014": "McAuliffe, C., McLeavey, B. C., Fitzgerald, T., Corcoran, P., Carroll, B., Ryan, L., O'Keeffe, B., Fitzgerald, E., Hickey, P., O'Regan, M., Mulqueen, J., & Arensman, E. (2014). Group problem-solving skills training for self-harm: randomised controlled trial. The British journal of psychiatry : the journal of mental science, 204, 383–390. https://doi.org/10.1192/bjp.bp.111.101816",
"McCauley 2018": "McCauley, E., Berk, M. S., Asarnow, J. R., Adrian, M., Cohen, J., Korslund, K., Avina, C., Hughes, J., Harned, M., Gallop, R., & Linehan, M. M. (2018). Efficacy of Dialectical Behavior Therapy for Adolescents at High Risk for Suicide: A Randomized Clinical Trial. JAMA psychiatry, 75(8), 777–785. https://doi.org/10.1001/jamapsychiatry.2018.1109",
"McLeavey 1994": "McLeavey, B. C., Daly, R. J., Ludgate, J. W., & Murray, C. M. (1994). Interpersonal Problem‐Solving skills training in the treatment of self‐poisoning patients. Suicide and Life‐Threatening Behavior, 24(4), 382-394.",
"McMain 2017": "McMain, S. F., Guimond, T., Barnhart, R., Habinski, L., & Streiner, D. L. (2017). A randomized trial of brief dialectical behaviour therapy skills training in suicidal patients suffering from borderline disorder. Acta psychiatrica Scandinavica, 135(2), 138–148. https://doi.org/10.1111/acps.12664",
"McManama O'Brien 2018": "McManama O'Brien, K. H., Sellers, C. M., Battalen, A. W., Ryan, C. A., Maneta, E. K., Aguinaldo, L. D., White, E., & Spirito, A. (2018). Feasibility, acceptability, and preliminary effects of a brief alcohol intervention for suicidal adolescents in inpatient psychiatric treatment. Journal of substance abuse treatment, 94, 105–112. https://doi.org/10.1016/j.jsat.2018.08.013",
"Melvin 2006": "Melvin, G. A., Tonge, B. J., King, N. J., Heyne, D., Gordon, M. S., & Klimkeit, E. (2006). A comparison of cognitive-behavioral therapy, sertraline, and their combination for adolescent depression. Journal of the American Academy of Child and Adolescent Psychiatry, 45(10), 1151–1161. https://doi.org/10.1097/01.chi.0000233157.21925.71",
"Miklowitz 2020": "Miklowitz, D. J., Merranko, J. A., Weintraub, M. J., Walshaw, P. D., Singh, M. K., Chang, K. D., & Schneck, C. D. (2020). Effects of family-focused therapy on suicidal ideation and behavior in youth at high risk for bipolar disorder. Journal of affective disorders, 275, 14-22.",
"Morley 2014": "Morley, K. C., Sitharthan, G., Haber, P. S., Tucker, P., & Sitharthan, T. (2014). The efficacy of an opportunistic cognitive behavioral intervention package (OCB) on substance use and comorbid suicide risk: a multisite randomized controlled trial. Journal of consulting and clinical psychology, 82(1), 130–140. https://doi.org/10.1037/a0035310",
"Morthorst 2012": "Morthorst, B., Krogh, J., Erlangsen, A., Alberdi, F., & Nordentoft, M. (2012).Effect of assertive outreach after suicide attempt in the AID (assertive intervention for deliberate self harm) trial: randomised controlled trial. BMJ (Clinical research ed.), 345, e4972. https://doi.org/10.1136/bmj.e4972",
"Naidoo 2014": "SS Naidoo, P Gathiram & L Schlebusch (2014). Effectiveness of a Buddy intervention support programme for suicidal behaviour in a primary care setting, South African Family Practice, 56:5, 263-270, DOI: 10.1080/20786190.2014.980159",
"O'Connor 2020": "O'Connor, R. C., Ferguson, E., Scott, F., Smyth, R., McDaid, D., Park, A. L., Beautrais, A., & Armitage, C. J. (2017). A brief psychological intervention to reduce repetition of self-harm in patients admitted to hospital following a suicide attempt: a randomised controlled trial. The lancet. Psychiatry, 4(6), 451–460. https://doi.org/10.1016/S2215-0366(17)30129-3",
"Patel 2017": "Patel, V., Weobong, B., Weiss, H. A., Anand, A., Bhat, B., Katti, B., Dimidjian, S., Araya, R., Hollon, S. D., King, M., Vijayakumar, L., Park, A. L., McDaid, D., Wilson, T., Velleman, R., Kirkwood, B. R., & Fairburn, C. G. (2017). The Healthy Activity Program (HAP), a lay counsellor-delivered brief psychological treatment for severe depression, in primary care in India: a randomised controlled trial. Lancet (London, England), 389(10065), 176–185. https://doi.org/10.1016/S0140-6736(16)31589-6",
"Patsiokas 1985": "Patsiokas, A. T., & Clum, G. A. (1985). Effects of psychotherapeutic strategies in the treatment of suicide attempters. Psychotherapy: Theory, Research, Practice, Training, 22(2), 281–290. https://doi.org/10.1037/h0085507",
"Pfeiffer 2019": "Pfeiffer, P. N., King, C., Ilgen, M., Ganoczy, D., Clive, R., Garlick, J., Abraham, K., Kim, H. M., Vega, E., Ahmedani, B., & Valenstein, M. (2019). Development and pilot study of a suicide prevention intervention delivered by peer support specialists. Psychological services, 16(3), 360–371. https://doi.org/10.1037/ser0000257",
"Pigeon 2019": "Pigeon, W. R., Funderburk, J. S., Cross, W., Bishop, T. M., & Crean, H. F. (2019). Brief CBT for insomnia delivered in primary care to patients endorsing suicidal ideation: a proof-of-concept randomized clinical trial. Translational behavioral medicine, 9(6), 1169–1177. https://doi.org/10.1093/tbm/ibz108",
"Pineda 2013": "Pineda, J., & Dadds, M. R. (2013). Family intervention for adolescents with suicidal behavior: a randomized controlled trial and mediation analysis. Journal of the American Academy of Child and Adolescent Psychiatry, 52(8), 851–862. https://doi.org/10.1016/j.jaac.2013.05.015",
"Pistorello 2020": "Pistorello, J., Jobes, D. A., Gallop, R., Compton, S. N., Locey, N. S., Au, J. S., Noose, S. K., Walloch, J. C., Johnson, J., Young, M., Dickens, Y., Chatham, P., & Jeffcoat, T. (2021). A Randomized Controlled Trial of the Collaborative Assessment and Management of Suicidality (CAMS) Versus Treatment as Usual (TAU) for Suicidal College Students. Archives of suicide research : official journal of the International Academy for Suicide Research, 25(4), 765–789. https://doi.org/10.1080/13811118.2020.1749742",
"Power 2003": "Power, P. J., Bell, R. J., Mills, R., Herrman-Doig, T., Davern, M., Henry, L., Yuen, H. P., Khademy-Deljo, A., & McGorry, P. D. (2003). Suicide prevention in first episode psychosis: the development of a randomised controlled trial of cognitive therapy for acutely suicidal patients with early psychosis. The Australian and New Zealand journal of psychiatry, 37(4), 414– 420. https://doi.org/10.1046/j.1440-1614.2003.01209.x",
"Pratt 2015": "Pratt, D., Tarrier, N., Dunn, G., Awenat, Y., Shaw, J., Ulph, F., & Gooding, P. (2015). Cognitive-behavioural suicide prevention for male prisoners: a pilot randomized controlled trial. Psychological medicine, 45(16), 3441–3451. https://doi.org/10.1017/S0033291715001348",
"Rahnama 2016": "Rahnama, Shirin & Tarkhan, Morteza & Khalatbari, Javad. (2013). Effectiveness of Imagery Rescripting and Reprocessing Therapy on Suicidal Ideation in Individuals with Suicide Attempt History. Procedia - Social and Behavioral Sciences. 84. 10.1016/j.sbspro.2013.06.706.",
"Riblet 2021": "Riblet, N. B., Stevens, S. P., Watts, B. V., Gui, J., Forehand, J., Cornelius, S., ... & Shiner, B. (2021). A pilot randomized trial of a brief intervention to prevent suicide after inpatient psychiatric discharge. Psychiatric services, 72(11), 1320-1323.",
"Rudd 1996": "Rudd, M. D., Rajab, M. H., Orman, D. T., Joiner, T., Stulman, D. A., & Dixon, W. (1996). Effectiveness of an outpatient intervention targeting suicidal young adults: preliminary results. Journal of consulting and clinical psychology, 64(1), 179–190. https://doi.org/10.1037//0022-006x.64.1.179",
"Rudd 2015": "Rudd, M. D., Bryan, C. J., Wertenberger, E. G., Peterson, A. L., Young- McCaughan, S., Mintz, J., Williams, S. R., Arne, K. A., Breitbach, J., Delano, K., Wilkinson, E., & Bruce, T. O. (2015). Brief cognitive-behavioral therapy effects on post-treatment suicide attempts in a military sample: results of a randomized clinical trial with 2-year follow-up. The American journal of psychiatry, 172(5), 441–449. https://doi.org/10.1176/appi.ajp.2014.14070843",
"Ryberg 2019": "Ryberg, W., Zahl, P. H., Diep, L. M., Landrø, N. I., & Fosse, R. (2019). Managing suicidality within specialized care: A randomized controlled trial. Journal of affective disorders, 249, 112–120. https://doi.org/10.1016/j.jad.2019.02.022",
"Salkovskis 1990": "Salkovskis, P. M., Atha, C., & Storer, D. (1990). Cognitive-behavioural problem solving in the treatment of patients who repeatedly attempt suicide a controlled trial. The British Journal of Psychiatry, 157(6), 871-876.",
"Samaraweera 2007": "Samaraweera, S., Sivayogan, S., Sumathipala, A., Bhugra, D., & Siribaddana,S. (2007). RCT of Cognitive Behaviour Therapy in active suicidal ideation-as feasibility study in Sri Lanka. The European Journal of Psychiatry, 21(3), 175–178. https://doi.org/10.4321/S0213-61632007000300001",
"Sanz Cruces 2018": "Sanz Cruces, J. M., García Cuenca, I. M., Lacomba-Trejo, L., Cuquerella Adell, M. Á., Cano Navarro, I., Ferrandis Cortés, M., Jordá Carreres, E., & Carbajo Álvarez, E. (2018). Group Therapy for Patients with Adjustment Disorder in Primary Care. The Spanish journal of psychology, 21, E50. https://doi.org/10.1017/sjp.2018.51",
"Sedghy 2022": "Sedghy, Z., Yoosefi, N., & Navidian, A. (2020). The effect of motivational interviewing-based training on the rate of using mental health services and intensity of suicidal ideation in individuals with suicide attempt admitted to the emergency department. Journal of education and health promotion, 9.",
"Shaygan 2022": "Shaygan, M., Sheybani Negad, S., & Motazedian, S. (2022). The effect of combined sertraline and positive psychotherapy on hopelessness and suicidal ideation among patients with major depressive disorder: a randomized controlled trial. The Journal of Positive Psychology, 17(5), 655-664.",
"Sheaves 2019": "Sheaves, B., Holmes, E. A., Rek, S., Taylor, K. M., Nickless, A., Waite, F., Germain, A., Espie, C. A., Harrison, P. J., Foster, R., & Freeman, D. (2019). Cognitive Behavioural Therapy for Nightmares for Patients with Persecutory Delusions (Nites): An Assessor-Blind, Pilot Randomized Controlled Trial. Canadian journal of psychiatry. Revue canadienne de psychiatrie, 64(10), 686–696. https://doi.org/10.1177/0706743719847422",
"Simpson 2011": "Simpson, G. K., Tate, R. L., Whiting, D. L., & Cotter, R. E. (2011). Suicide prevention after traumatic brain injury: a randomized controlled trial of a program for the psychological treatment of hopelessness. The Journal of head trauma rehabilitation, 26(4), 290–300. Simon, G. E., Beck, A., Rossom, R., Richards, J., Kirlin, B., King, D., Shulman, L., Ludman, E. J., Penfold, R., Shortreed, S. M., & Whiteside, U. (2016). Population-based outreach versus care as usual to prevent suicide attempt: study protocol for a randomized controlled trial. Trials, 17(1), 452. https://doi.org/10.1186/s13063-016-1566-z159.https://doi.org/10.1097/HTR.0b013e3182225250",
"Sinniah 2017": "Sinniah, A., Oei, T., Maniam, T., & Subramaniam, P. (2017). Positive effects of Individual Cognitive Behavior Therapy for patients with unipolar mood disorders with suicidal ideation in Malaysia: A randomised controlled trial. Psychiatry research, 254, 179–189. https://doi.org/10.1016/j.psychres.2017.04.026",
"Slee 2008": "Slee, N., Garnefski, N., van der Leeden, R., Arensman, E., & Spinhoven, P. (2008). Cognitive-behavioural intervention for self-harm: randomised controlled trial. The British journal of psychiatry : the journal of mental science, 192(3), 202–211. https://doi.org/10.1192/bjp.bp.107.037564",
"Slesnick 2019": "Slesnick, N., Zhang, J., Feng, X., Wu, Q., Walsh, L., & Granello, D. H. (2020). Cognitive therapy for suicide prevention: A randomized pilot with suicidal youth experiencing homelessness. Cognitive Therapy and Research, 44, 402-411.",
"Spirito 2015": "Spirito, A., Wolff, J. C., Seaboyer, L. M., Hunt, J., Esposito-Smythers, C., Nugent, N., Zlotnick, C., & Miller, I. (2015). Concurrent treatment for adolescent and parent depressed mood and suicidality: feasibility, acceptability, and preliminary findings. Journal of child and adolescent psychopharmacology, 25(2), 131–139. https://doi.org/10.1089/cap.2013.0130",
"Springer 1996": "Springer, T., Lohr, N. E., Buchtel, H. A., & Silk, K. R. (1996). A preliminary report of short-term cognitive-behavioral group therapy for inpatients with personality disorders. The Journal of psychotherapy practice and research, 5(1), 57–71.",
"Tang 2009": "Tang, T. C., Jou, S. H., Ko, C. H., Huang, S. Y., & Yen, C. F. (2009). Randomized study of school-based intensive interpersonal psychotherapy for depressed adolescents with suicidal risk and parasuicide behaviors. Psychiatry and clinical neurosciences, 63(4), 463–470. https://doi.org/10.1111/j.1440- 1819.2009.01991.x",
"Tarrier 2014": "Tarrier, N., Kelly, J., Maqsood, S., Snelson, N., Maxwell, J., Law, H., Dunn, G., & Gooding, P. (2014). The cognitive behavioural prevention of suicide in psychosis: a clinical trial. Schizophrenia research, 156(2-3), 204–210. https://doi.org/10.1016/j.schres.2014.04.029",
"Tighe 2017": "Tighe, J., Shand, F., Ridani, R., Mackinnon, A., De La Mata, N., & Christensen, H. (2017). Ibobbly mobile health intervention for suicide prevention in Australian Indigenous youth: a pilot randomised controlled trial. BMJ open, 7(1), e013518. https://doi.org/10.1136/bmjopen-2016-013518 174.Turner, R. M. (2000). Naturalistic evaluation of dialectical behavior therapy-oriented treatment for borderline personality disorder. Cognitive and Behavioral Practice, 7(4), 413–419. https://doi.org/10.1016/S1077-7229(00)80052-8",
"Turner 2000": "Turner, R. M. (2000). Naturalistic evaluation of dialectical behavior therapyoriented treatment for borderline personality disorder. Cognitive and Behavioral Practice, 7(4), 413–419. https://doi.org/10.1016/S1077- 7229(00)80052-8",
"Tyrer 2003": "Tyrer, P., Thompson, S., Schmidt, U., Jones, V., Knapp, M., Davidson, K., Catalan, J., Airlie, J., Baxter, S., Byford, S., Byrne, G., Cameron, S., Caplan, R., Cooper, S., Ferguson, B., Freeman, C., Frost, S., Godley, J., Greenshields, J., Henderson, J., … Wessely, S. (2003). Randomized controlled trial of brief cognitive behaviour therapy versus treatment as usual in recurrent deliberate self-harm: the POPMACT study. Psychological medicine, 33(6), 969–976. https://doi.org/10.1017/s0033291703008171",
"Van Beek 2013": "Van Beek, W. Future thinking in suicidal patients, Ede: Print Service Ede B.V. , 2013, p226.",
"Van Wel 2009": "van Wel, E. B., Bos, E. H., Appelo, M. T., Berendsen, E. M., Willgeroth, F. C., & Verbraak, M. J. (2009). De effectiviteit van de vaardigheidstraining emotieregulatiestoornis (VERS) in de behandeling van de borderlinepersoonlijkheidsstoornis; een gerandomiseerd onderzoek [The efficacy of the systems training for emotional predictability and problem solving (STEPPS) in the treatment of borderline personality disorder. A randomized controlled trial]. Tijdschrift voor psychiatrie, 51(5), 291–301.",
"Van der Sande 1997": "van der Sande, R., van Rooijen, L., Buskens, E., Allart, E., Hawton, K., van der Graaf, Y., & van Engeland, H. (1997). Intensive in-patient and community intervention versus routine care after attempted suicide. A randomised controlled intervention study. The British journal of psychiatry : the journal of mental science, 171, 35–41. https://doi.org/10.1192/bjp.171.1.35",
"Verheul 2003": "Verheul, R., Van Den Bosch, L. M., Koeter, M. W., De Ridder, M. A., Stijnen, T., & Van Den Brink, W. (2003). Dialectical behaviour therapy for women with borderline personality disorder: 12-month, randomised clinical trial in The Netherlands. The British journal of psychiatry : the journal of mental science, 182, 135–140. https://doi.org/10.1192/bjp.182.2.135",
"Walker 2016": "Walker, T., Shaw, J., Turpin, C., Reid, C., & Abel, K. (2017). The WORSHIP II study: a pilot of psychodynamic interpersonal therapy with women offenders who self-harm. The Journal of Forensic Psychiatry & Psychology, 28(2), 158-171.",
"Ward-Ciesielski 2017": "Ward-Ciesielski, E. F., Tidik, J. A., Edwards, A. J., & Linehan, M. M. (2017).Comparing brief interventions for suicidal individuals not engaged in treatment: A randomized clinical trial. Journal of affective disorders, 222, 153–161. https://doi.org/10.1016/j.jad.2017.07.011",
"Wei 2013": "Wei, S., Liu, L., Bi, B., Li, H., Hou, J., Tan, S., Chen, X., Chen, W., Jia, X.,Dong, G., Qin, X., & Liu, Y. (2013). An intervention and follow-up study following a suicide attempt in the emergency departments of four general hospitals in Shenyang, China. Crisis, 34(2), 107–115. https://doi.org/10.1027/0227-5910/a000181",
"Weinberg 2006": "Weinberg, I., Gunderson, J. G., Hennen, J., & Cutter, C. J., Jr (2006). Manual assisted cognitive treatment for deliberate self-harm in borderline personality disorder patients. Journal of personality disorders, 20(5), 482–492. https://doi.org/10.1521/pedi.2006.20.5.482",
"Weinstein 2018": "Weinstein, S. M., Cruz, R. A., Isaia, A. R., Peters, A. T., & West, A. E. (2018). Child- and Family-Focused Cognitive Behavioral Therapy for Pediatric Bipolar Disorder: Applications for Suicide Prevention. Suicide & life-threatening behavior, 48(6), 797–811. https://doi.org/10.1111/sltb.12416",
"Wharff 2019": "Wharff, E. A., Ginnis, K. B., Ross, A. M., White, E. M., White, M. T., & Forbes, P. W. (2019). Family-Based Crisis Intervention With Suicidal Adolescents: A Randomized Clinical Trial. Pediatric emergency care, 35(3), 170–175. https://doi.org/10.1097/PEC.0000000000001076",
"Wilks 2018": "Wilks, C. R., Lungu, A., Ang, S. Y., Matsumiya, B., Yin, Q., & Linehan, M.M. (2018). A randomized controlled trial of an Internet delivered dialectical behavior therapy skills training for suicidal and heavy episodic drinkers. Journal of affective disorders, 232, 219–228. https://doi.org/10.1016/j.jad.2018.02.053",
"Wood 2001": "Wood, A., Trainor, G., Rothwell, J., Moore, A., & Harrington, R. (2001). Randomized trial of group therapy for repeated deliberate self-harm in adolescents. Journal of the American Academy of Child and Adolescent Psychiatry, 40(11), 1246–1253. https://doi.org/10.1097/00004583-200111000-",
"Wu (R) 2021": "Wu, R., Zhong, S. Y., Wang, G. H., Wu, M. Y., Xu, J. F., Zhu, H., ... & Jiang, C. L. (2023). The effect of brief mindfulness meditation on suicidal ideation, stress and sleep quality. Archives of suicide research, 27(2), 215-230.",
"Yen 2019": "Yen, S., Ranney, M. L., Krek, M., Peters, J. R., Mereish, E. H., Tezanos, K. M., Kahler, C. W., Solomon, J., Beard, C., & Spirito, A. (2020). Skills to Enhance Positivity in Suicidal Adolescents: Results from a Pilot Randomized Clinical Trial. The journal of positive psychology, 15(3), 348–361. https://doi.org/10.1080/17439760.2019.1615105" 
}
